<?php
$_config_arr['Artwork']['err'] = [
    '1' => '曝光',
    '2' => '有褶皱',
    '3' => '变形失真',
    '4' => '非正面拍摄',
    '5' => '作品不清晰',
    '6' => '图片像素小于498px',
    '7' => '有背景需重拍',
    '8' => '有水印',
    '9' => '图片颠倒',
    '10' => '有背景(客服可裁剪)',
    '11' => '作品尺寸描述错误',
    '12' => '作品尺寸长宽颠倒',
    '13' => '此类别不销售',
    '14' => '临摹非原创',
    '15' => '虚假作品删除'
];

$_config_arr['Artwork']['status'] = [
    "0" => "待审核",
    "1" => "审核通过",
    '2' => '已经出售',
    '3' => '问题艺术品',
    '4' => '问题艺术品',
    "5" =>"未知",
    "6" =>"未知",
    "7" =>"未知",
    "8" =>"未知",
    "9" =>"未知",
    "10" =>"未知",
    "11" =>"未知",
    "12" =>"未知",
    
];
$_config_arr['Artwork']['cata'] = [
    "1" => "油画",
    "2" => "国画",
    '5' => '书法',
    '44' => '杂项'
];
?>